Ol√°, Gustavo

Meu nome √© Ramon. Ao ao longo do texto farei algumas observa√ß√µes sobre melhorias no c√≥digo. Nas partes em que n√£o houver coment√°rios, est√° tudo certo, ok? Estarei aberto a feedbacks e discuss√µes sobre o tema.

**Pe√ßo que mantenha e n√£o altere os coment√°rios que eu fizer por aqui para que possamos nos localizar posteriormente, ok?**

Mais uma coisa, vamos utilizar um c√≥digo de cores para voc√™ entender os meus feedbacks no seu notebook. Funciona assim:

<div class="alert alert-block alert-success">
<b> Coment√°rio do revisor: </b> <a class="tocSkip"></a>

Sucesso. Tudo foi feito corretamente.
</div>

<div class="alert alert-block alert-warning">
<b>Coment√°rio do revisor: </b> <a class="tocSkip"></a>

Alerta n√£o cr√≠tco, mas que pode ser corrigido para melhoria geral no seu c√≥digo/an√°lise
</div>

<div class="alert alert-block alert-danger">

<b>Coment√°rio do revisor: </b> <a class="tocSkip"></a>
    
Erro que precisa ser consertado, caso contr√°rio seu projeto **n√£o** ser√° aceito.
</div>

Voc√™ pode me responder usando isso:
<div class="alert alert-block alert-info">
<b>Resposta do Aluno.</b> <a class="tocSkip"></a>
</div>

###

<div class="alert alert-block alert-success">
<b>Coment√°rio Geral do Revisor</b> <a class="tocSkip"></a>

Obrigado por enviar seu projeto. 
    
Parab√©ns, voc√™ fez um bom trabalho.
    
<span class="text-danger">Por√©m, h√° espa√ßo para melhorias conforme os itens apontados anteriormente. Destaco os  pontos a seguir: </span>
 * <span class="text-danger"> H√° alguns SQLs que precisam de ajuste. Deixei dicas. </span>


Portanto, sugiro que voc√™ corrija os pontos indicados.
    
Se voc√™ tiver alguma d√∫vida sobre de algo que voc√™ n√£o tenha entendido, sinta-se √† vontade para perguntar ao tutor ou deixar um coment√°rio em **azul** para que, na pr√≥xima itera√ß√£o, eu possa responder.

Conte conosco. Lembre-se de que voc√™ pode tirar d√∫vidas com revisores usando os coment√°rios ou buscar ajuda de um tutor.
Bom trabalho. 


</div>

<div class="alert alert-block alert-success">
<b> Coment√°rio final do revisor: </b> <a class="tocSkip"></a>

Tudo certo agora. Desejo sucesso na jornada. Parab√©ns pelo empenho.
</div>

# Objetivos do Estudo

O objetivo deste estudo √© analisar o comportamento dos leitores a partir de um banco de dados contendo informa√ß√µes sobre livros, autores, editoras, classifica√ß√µes e resenhas de usu√°rios. A an√°lise √© parte do processo de avalia√ß√£o de mercado para o desenvolvimento de um novo aplicativo voltado a leitores, em resposta ao aumento do consumo de livros durante o per√≠odo da pandemia.

As perguntas-chave do estudo incluem:

- Quais editoras e autores t√™m maior presen√ßa no mercado?
- Quais livros s√£o mais bem avaliados e quais recebem mais aten√ß√£o dos leitores?
- Como se comportam os leitores mais engajados?
- Qual o perfil das obras com maior volume e qualidade de avalia√ß√µes?

Essas an√°lises permitir√£o compreender melhor as prefer√™ncias dos leitores e identificar padr√µes relevantes para apoiar decis√µes estrat√©gicas no desenvolvimento de um novo produto digital para esse p√∫blico.

In [2]:
# Bibliotecas
import pandas as pd
from sqlalchemy import create_engine

db_config = {
    'user': 'practicum_student',
    'pwd': 'QnmDH8Sc2TQLvy2G3Vvh7',
    'host': 'yp-trainers-practicum.cluster-czs0gxyx2d8w.us-east-1.rds.amazonaws.com',
    'port': 5432,
    'db': 'data-analyst-final-project-db'
}

connection_string = f"postgresql://{db_config['user']}:{db_config['pwd']}@{db_config['host']}:{db_config['port']}/{db_config['db']}"
engine = create_engine(connection_string, connect_args={'sslmode': 'require'})

### Explora√ß√£o Inicial das Tabelas

Antes de iniciar as consultas anal√≠ticas, observei as primeiras linhas de cada tabela para entender sua estrutura e confirmar a consist√™ncia dos dados dispon√≠veis.

As tabelas dispon√≠veis s√£o:

- `books`: cont√©m informa√ß√µes sobre livros, incluindo t√≠tulo, n√∫mero de p√°ginas, data de publica√ß√£o, autor e editora.
- `authors`: cont√©m os nomes dos autores, relacionados via `author_id`.
- `publishers`: cont√©m os nomes das editoras, relacionados via `publisher_id`.
- `ratings`: traz as avalia√ß√µes num√©ricas feitas por usu√°rios sobre os livros.
- `reviews`: cont√©m as resenhas textuais feitas por usu√°rios sobre os livros.

A visualiza√ß√£o inicial ajudou a entender os relacionamentos entre as tabelas e definir a abordagem para as consultas SQL a seguir.

In [3]:
# livros
pd.read_sql('SELECT * FROM books LIMIT 5', con=engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [4]:
# autores
pd.read_sql('SELECT * FROM authors LIMIT 5', con=engine)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [5]:
# editoras
pd.read_sql('SELECT * FROM publishers LIMIT 5', con=engine)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [6]:
# avalia√ß√µes num√©ricas
pd.read_sql('SELECT * FROM ratings LIMIT 5', con=engine)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [7]:
# resenhas textuais
pd.read_sql('SELECT * FROM reviews LIMIT 5', con=engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

In [8]:
# Encontre o n√∫mero de livros lan√ßados depois de 1 de janeiro de 2000

query = '''
SELECT COUNT(*) AS livros_pos_2000
FROM books
WHERE publication_date > '2000-01-01';
'''

pd.read_sql(query, con=engine)

   livros_pos_2000
0              819

### Tarefa 1: Livros lan√ßados ap√≥s 1¬∫ de janeiro de 2000

Foi realizada uma consulta para contar quantos livros foram publicados ap√≥s a data de 01/01/2000.

**Resultado:** 819 livros foram lan√ßados ap√≥s essa data.

```sql
SELECT COUNT(*) AS livros_pos_2000
FROM books
WHERE publication_date > '2000-01-01';

In [9]:
# Encontre o n√∫mero de avalia√ß√µes e a classifica√ß√£o m√©dia para cada livro

query = '''
SELECT
    b.title,
    r.book_id,
    COUNT(*) AS total_avaliacoes,
    ROUND(AVG(r.rating), 2) AS media_classificacao
FROM ratings AS r
JOIN books AS b ON r.book_id = b.book_id
GROUP BY r.book_id, b.title
ORDER BY total_avaliacoes DESC
LIMIT 10;
'''

pd.read_sql(query, con=engine)

,title,book_id,total_avaliacoes,media_classificacao
0,Twilight (Twilight #1),948,160,3.66
1,The Hobbit or There and Back Again,750,88,4.13
2,The Catcher in the Rye,673,86,3.83
3,Angels & Demons (Robert Langdon #1),75,84,3.68
4,Harry Potter and the Prisoner of Azkaban (Harr...,302,82,4.41
5,Harry Potter and the Chamber of Secrets (Harry...,299,80,4.29
6,Harry Potter and the Order of the Phoenix (Har...,301,75,4.19
7,Animal Farm,79,74,3.73
8,The Fellowship of the Ring (The Lord of the Ri...,722,74,4.39
9,Harry Potter and the Half-Blood Prince (Harry ...,300,73,4.25


<div class="alert alert-block alert-danger">
<b> Coment√°rio do revisor: </b> <a class="tocSkip"></a>

Precisa apresnetar o nome. Deixo dica abaixo
</div>

In [1]:
# query_t2 = """SELECT
#               books.title,
#               subquery.avg_rating,
#               subquery.review_count
#               FROM
#                   (SELECT
#                        reviews.book_id as book_id,
#                        COUNT (DISTINCT reviews.review_id) AS review_count,
#                        AVG (ratings.rating) AS avg_rating
#                    FROM
#                        reviews
#                        INNER JOIN ratings ON ratings.book_id = reviews.book_id
#                    GROUP BY
#                        reviews.book_id
#                    ORDER BY
#                        review_count DESC,
#                        avg_rating DESC) AS subquery
#                    INNER JOIN books ON subquery.book_id = books.book_id
#               ORDER BY
#                   review_count DESC,
#                   avg_rating DESC
#               LIMIT 10"""


<div class="alert alert-block alert-warning">
<b> Coment√°rio do revisor v2: </b> <a class="tocSkip"></a>

Vou considerar a resposta, pois de fato voc√™ usou o n√∫mero de avalia√ß√µes (como notas em vez de reviews). 
</div>

### ### üîç Tarefa 2: N√∫mero de avalia√ß√µes e m√©dia de classifica√ß√£o por livro

Esta consulta identificou os livros mais avaliados da base, agora incluindo os respectivos t√≠tulos (`title`) para facilitar a interpreta√ß√£o dos resultados.

**Top 10 livros com maior n√∫mero de avalia√ß√µes:**

| T√≠tulo | Total de Avalia√ß√µes | M√©dia de Classifica√ß√£o |
|--------|---------------------|-------------------------|
| Twilight (Twilight #1) | 160 | 3.66 |
| The Hobbit or There and Back Again | 88 | 4.13 |
| The Catcher in the Rye | 86 | 3.83 |
| Angels & Demons (Robert Langdon #1) | 84 | 3.68 |
| Harry Potter and the Prisoner of Azkaban | 82 | 4.41 |
| ... | ... | ... |

Esses dados ajudam a entender quais t√≠tulos atraem maior participa√ß√£o do p√∫blico e como est√£o sendo avaliados por leitores em grande volume.

In [7]:
# Identifique a editora que lan√ßou o maior n√∫mero de livros com mais de 50 p√°ginas

query = '''
SELECT
    p.publisher,
    COUNT(b.book_id) AS total_livros
FROM books AS b
JOIN publishers AS p ON b.publisher_id = p.publisher_id
WHERE b.num_pages > 50
GROUP BY p.publisher
ORDER BY total_livros DESC
LIMIT 1;
'''

pd.read_sql(query, con=engine)

       publisher  total_livros
0  Penguin Books            42

### Tarefa 3: Editora com mais livros com mais de 50 p√°ginas

Para garantir que a an√°lise se concentre em livros substanciais (excluindo brochuras e publica√ß√µes curtas), filtrei os livros com mais de 50 p√°ginas e agrupei os dados por editora.

**Resultado:** A editora com mais livros acima de 50 p√°ginas foi **Penguin Books**, com **42 publica√ß√µes**.

Essa informa√ß√£o pode ser √∫til para segmentar melhor os dados em an√°lises futuras.

In [8]:
# Identifique o autor com a m√©dia mais alta de classifica√ß√£o de livros: olhe apenas para livros com pelo menos 50 classifica√ß√µes.

query = '''
WITH livros_filtrados AS (
    SELECT
        book_id,
        COUNT(*) AS total_ratings,
        AVG(rating) AS media_rating
    FROM ratings
    GROUP BY book_id
    HAVING COUNT(*) >= 50
)

SELECT
    a.author,
    ROUND(AVG(lf.media_rating), 2) AS media_geral_autor
FROM livros_filtrados AS lf
JOIN books AS b ON lf.book_id = b.book_id
JOIN authors AS a ON b.author_id = a.author_id
GROUP BY a.author
ORDER BY media_geral_autor DESC
LIMIT 1;
'''

pd.read_sql(query, con=engine)

                       author  media_geral_autor
0  J.K. Rowling/Mary GrandPr√©               4.28

### Tarefa 4: Autor com a maior m√©dia de classifica√ß√£o (livros com 50+ avalia√ß√µes)

Nesta etapa, o objetivo era identificar o autor cuja m√©dia de avalia√ß√µes de livros fosse a mais alta, considerando apenas livros que receberam **pelo menos 50 classifica√ß√µes** ‚Äî isso garante maior confiabilidade estat√≠stica.

**Resultado:**  
- Autor: **J.K. Rowling/Mary GrandPr√©**  
- M√©dia geral de classifica√ß√£o: **4.28**

Essa m√©trica ajuda a destacar autores com alto desempenho entre leitores, com base em volume relevante de feedback.

In [10]:
# Encontre o n√∫mero m√©dio de avalia√ß√µes entre usu√°rios que classificaram mais do que 50 livros.

query = '''
SELECT
    AVG(subquery2.review_cnt) AS avg_review_cnt
FROM (
    SELECT
        COUNT(reviews.review_id) AS review_cnt,
        subquery1.username
    FROM (
        SELECT
            username,
            COUNT(rating_id) AS rating_cnt
        FROM ratings
        GROUP BY username
        HAVING COUNT(rating_id) > 50
    ) AS subquery1
    INNER JOIN reviews ON reviews.username = subquery1.username
    GROUP BY subquery1.username
) AS subquery2;
'''

pd.read_sql(query, con=engine)

   avg_review_cnt
0       24.333333


<div class="alert alert-block alert-danger">
<b> Coment√°rio do revisor: </b> <a class="tocSkip"></a>

Query est√° incorreta pois precisa usar reviews em vez de ratings. Dica abaixo:
</div>

In [2]:
# query_t5 = """SELECT
#                   AVG (subquery2.review_cnt) AS avg_review_cnt
#               FROM
#                   (SELECT
#                       COUNT (reviews.review_id) as review_cnt,
#                       subquery1.username
#                   FROM
#                       (SELECT
#                           username,
#                           COUNT (rating_id) AS rating_cnt
#                       FROM
#                           ratings
#                       GROUP BY
#                           username
#                       HAVING
#                           COUNT (rating_id) > 50) AS subquery1
#                       INNER JOIN reviews ON reviews.username = subquery1.username
#                   GROUP BY
#                       subquery1.username) AS subquery2"""

<div class="alert alert-block alert-success">
<b> Coment√°rio do revisor v2: </b> <a class="tocSkip"></a>

correto

</div>

### Tarefa 5: M√©dia de resenhas entre usu√°rios que classificaram mais de 50 livros

O objetivo desta tarefa era calcular, entre os usu√°rios que classificaram mais de 50 livros (`ratings`), qual o n√∫mero m√©dio de resenhas textuais (`reviews`) que eles escreveram.

**Resultado:**  
Esses usu√°rios escreveram, em m√©dia, **24.33 resenhas**.

Esse dado mostra que o p√∫blico mais engajado n√£o apenas avalia muitos livros, como tamb√©m costuma contribuir com feedbacks mais completos.  
Isso pode ser relevante para funcionalidades como sistema de reputa√ß√£o ou curadoria de conte√∫do no novo aplicativo.

### Conclus√£o do Projeto SQL

A an√°lise realizada com SQL permitiu extrair insights relevantes sobre o comportamento dos leitores e a qualidade do acervo, com base em livros, autores, editoras, classifica√ß√µes e resenhas dispon√≠veis na base de dados.

Principais descobertas:

- O cat√°logo possui **819 livros lan√ßados ap√≥s o ano 2000**, indicando boa oferta de publica√ß√µes contempor√¢neas.
- Os livros mais populares em n√∫mero de avalia√ß√µes incluem t√≠tulos conhecidos como *Twilight*, *The Hobbit* e obras da saga *Harry Potter*, com destaque tanto em quantidade de avalia√ß√µes quanto em m√©dia de nota.
- A editora **Penguin Books** foi a que mais publicou livros com mais de 50 p√°ginas, totalizando **42 t√≠tulos** ‚Äî o que a destaca na categoria de publica√ß√µes mais substanciais.
- O autor **J.K. Rowling/Mary GrandPr√©** apresentou a melhor m√©dia de classifica√ß√£o entre livros com pelo menos 50 avalia√ß√µes, com nota m√©dia de **4.28**.
- Entre os leitores mais ativos (aqueles que classificaram mais de 50 livros), a m√©dia de **resenhas escritas** foi de **24.33**, revelando um grupo de usu√°rios engajados n√£o s√≥ em avaliar, mas tamb√©m em compartilhar opini√µes mais completas.

Esses achados ajudam a delinear oportunidades para o desenvolvimento de um aplicativo voltado a leitores, identificando conte√∫dos e perfis que merecem aten√ß√£o especial na constru√ß√£o de funcionalidades e estrat√©gias de recomenda√ß√£o.